src/InformationRegisters/ГП_НормыПотребленияБП77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГП_НормыПотребленияБП77</Name>
			<Comment>// Гарант+</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НормаХВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаГВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентХВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентГВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдИзмНормыХВКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдИзмНормыГВКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдИзмКоличестваХВКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдИзмКоличестваГВКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособФинансированияКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидТарифаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдИзмНормыХВНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдИзмНормыГВНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдИзмКоличестваХВНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдИзмКоличестваГВНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФинансированияНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифаНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НормаПотребленияУслуг</Name>
					<Comment>Связь данных с объектом ИБ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КВП_НормыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/КВП_Услуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КВП_Услуги</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГП_ИдентификаторБП77</Name>
					<Comment>// Гарант+</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГП_СозданАвтоматически</Name>
					<Comment>// Гарант+</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КВП_НормыПотребленияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КВП_НормыПотребленияУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГП_ИдентификаторБП77</Name>
					<Comment>// Гарант+</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГП_СозданАвтоматически</Name>
					<Comment>// Гарант+</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ГП_МиграцияНормПотребления/Ext/Module.bsl
// Гарант+ Килипенко 14.08.2024 [F00227047] перенос норм потребления из БП77 ++
#Область ПрограммныйИнтерфейс

// Выполняет чтение данных норм потребления (ГруппыПотребителей) (из БП 7.7) из файла и записывает
//  данные в регистр `ГП_НормыПотребленияБП77`
// Параметры:
//  ПараметрыЗагрузки - Структура
//      * ДвоичныеДанныеФайла - ДвоичныеДанные
//      * СохранятьСвязи - Булево - Если Ложь, установленные связи с БанковскимСчетом
//                                      будут разорваны (поле `БанковскийСчет` будет установлено в значение пустая ссылка)
//  АдресХранилища - Строка, Неопределено
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоЗаписанных - Число
//      * ТекстСообщения - Строка, Неопределено
//  - Неопределено
Функция ЗагрузитьДанныеНормПотребленийВРегистр(ПараметрыЗагрузки, АдресХранилища = Неопределено) Экспорт
    РезультатФункции = Новый Структура("Успех, КоличествоЗаписанных, ТекстСообщения", Ложь, 0);

    // Чтение данных из файла XML
    РезультатЧтенияДанных = ГП_МиграцияОбщегоНазначения.ПрочитатьДанныеИзФайлаXML(
            ПараметрыЗагрузки.ДвоичныеДанныеФайла, "ГруппаПотребителя");
    Если РезультатЧтенияДанных.Успех = Ложь Тогда
        РезультатФункции.ТекстСообщения = РезультатЧтенияДанных.ТекстСообщения;
        Возврат ГП_МиграцияОбщегоНазначения.ПоместитьВХранилищеИВернуть(РезультатФункции, АдресХранилища);
    КонецЕсли;

    // Проверка структуры данных
    Если ТипЗнч(РезультатЧтенияДанных.Данные) <> Тип("СписокXDTO") Тогда
        РезультатФункции.ТекстСообщения = "Ошибка структуры данных.";
        Возврат ГП_МиграцияОбщегоНазначения.ПоместитьВХранилищеИВернуть(РезультатФункции, АдресХранилища);
    КонецЕсли;

    // Запись данных в регистр
    НормыПотребленияБП77 = РезультатЧтенияДанных.Данные;
    РезультатЗаписи = ЗаписатьДанныеНормПотребленийВРегистр(НормыПотребленияБП77, ПараметрыЗагрузки.СохранятьСвязи);

    // Формирование результата
    РезультатФункции.Успех = РезультатЗаписи.Успех;
    РезультатФункции.ТекстСообщения = РезультатЗаписи.СообщениеОбОшибке;
    РезультатФункции.КоличествоЗаписанных = РезультатЗаписи.КоличествоЗаписанных;

    Возврат ГП_МиграцияОбщегоНазначения.ПоместитьВХранилищеИВернуть(РезультатФункции, АдресХранилища);
КонецФункции

// Создает нормы потребления холодной воды по виду тарифа "для населения"
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * СозданныеНормыПотребления - Массив из СправочникСсылка.БанковскиеСчета
//      * ТекстСообщения - Строка, Неопределено
Функция СоздатьНормыПотребленияХолоднойВодыДляНаселения() Экспорт
    РезультатФункции = Новый Структура("Успех, СозданныеНормыПотребления, ТекстСообщения", Истина, Новый Массив);

    ТаблицаДляСозданияНормПотребления = ПолучитьТаблицуДанныхДляСозданияНормПотребленияХВДляНаселения();

    УслугаХолодноеВодоснабжение = Справочники.КВП_Услуги.НайтиПоКоду("00-001");
    ЕдиницыИзмеренияЛитры = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("112");

    НачатьТранзакцию();
    Попытка
        Для Каждого НормаПотребленияБП77 Из ТаблицаДляСозданияНормПотребления Цикл
            НовыйНормаПотребленияОбъект = Справочники.КВП_НормыПотребленияУслуг.СоздатьЭлемент();
            НовыйНормаПотребленияОбъект.Наименование = НормаПотребленияБП77.Наименование;

            НовыйНормаПотребленияОбъект.Владелец = УслугаХолодноеВодоснабжение;
            НовыйНормаПотребленияОбъект.НормаНаЛицевойСчет = Истина;
            НовыйНормаПотребленияОбъект.ЕдиницаИзмерения = ЕдиницыИзмеренияЛитры;
            НовыйНормаПотребленияОбъект.ВариантНастройки = Перечисления.КВП_ВариантыНастроекРасчетаНормативовПотребления.Простой;
            НовыйНормаПотребленияОбъект.Основание = Перечисления.КВП_ОснованияНормПотребления.ОдинЧеловек;
            НовыйНормаПотребленияОбъект.ВидЖильцов = Перечисления.УПЖКХ_ВидыЖильцов.Зарегистрированные;
            НовыйНормаПотребленияОбъект.ВариантОпределенияКоличестваЖильцовПриОтсутствииПроживающихИлиЗарегистрированных =
                Перечисления.УПЖКХ_ВариантыРасчетаНормативаПриОтсутствииЖильцов.НеОпределять;
            НовыйНормаПотребленияОбъект.Размер = НормаПотребленияБП77.НормаХВ;

            // Поля миграции
            НовыйНормаПотребленияОбъект.ГП_СозданАвтоматически = Истина;
            НовыйНормаПотребленияОбъект.ГП_ИдентификаторБП77 = НормаПотребленияБП77.Код;

            НовыйНормаПотребленияОбъект.Записать();
            РезультатФункции.СозданныеНормыПотребления.Добавить(НовыйНормаПотребленияОбъект.Ссылка);
        КонецЦикла;

        ЗафиксироватьТранзакцию(); // Записано успешно
    Исключение
        ОтменитьТранзакцию();

        ОбщаяЧастьСообщения = "Ошибка при создании норм потребления услуг.";
        СтруктураОшибки = ГП_МиграцияОбщегоНазначения.ЗаписатьОшибкуВЖурнал(
                ОбщаяЧастьСообщения, ИнформацияОбОшибке(), Ложь, Истина);

        РезультатФункции.Успех = Ложь;
        РезультатФункции.ТекстСообщения = СтрШаблон(
                "%1
                |Информация об ошибке: %2",
                ОбщаяЧастьСообщения,
                СтруктураОшибки.КраткоеПредставлениеОшибки);

        РезультатФункции.СозданныеНормыПотребления.Очистить();
    КонецПопытки;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 14.08.2024 [F00227047] перенос норм потребления из БП77 --

// Гарант+ Килипенко 14.08.2024 [F00227047] перенос норм потребления из БП77 ++
#Область СлужебныйПрограммныйИнтерфейс

// Выполняет запись исходных данных норм потребления в регистр `ГП_НормыПотребленияБП77` (по данным из БП77)
//  Существующие записи по отбору составного кода будут перезаписаны
// Параметры:
//  ИсходныеДанныеНормПотреблений - Массив из Структура - Данные БП77
//  СохранятьСвязи - Булево - Если Истина, связи с Нормами потребления услуг будут сохранены
// Возвращаемое значение:
//  Структура:
//      * Успех - Булево
//      * КоличествоЗаписанных - Число
//      * КоличествоСохраненныхСвязей - Число
//      * СообщениеОбОшибке - Строка, Неопределено
Функция ЗаписатьДанныеНормПотребленийВРегистр(Знач ИсходныеДанныеНормПотреблений, Знач СохранятьСвязи = Истина) Экспорт
    РезультатФункции = Новый Структура(
            "Успех, КоличествоЗаписанных, КоличествоСохраненныхСвязей, СообщениеОбОшибке", Истина, 0, 0);

    Если ИсходныеДанныеНормПотреблений = Неопределено ИЛИ ИсходныеДанныеНормПотреблений.Количество() = 0 Тогда
        Возврат РезультатФункции; // Нет данных
    КонецЕсли;

    // Поля для предобработки (приведения типов)
    КлючиЧисел = "НормаХВ,НормаГВ,ПроцентХВ,ПроцентГВ";

    // Транзакция записи в регистр ГП_ДоговорыБП77
    НачатьТранзакцию();
    Попытка

        Для Каждого НормаПотребленияБП77 Из ИсходныеДанныеНормПотреблений Цикл
            НаборЗаписейНормПотреблений = СоздатьНаборЗаписейНормПотребленияБП77(НормаПотребленияБП77);

            // Данные для сохранения связи
            СвязанныйНормаПотребленияУслуг = Неопределено;
            Если СохранятьСвязи Тогда
                НаборЗаписейНормПотреблений.Прочитать();
                Если НаборЗаписейНормПотреблений.Количество() > 0 Тогда
                    СвязанныйНормаПотребленияУслуг = НаборЗаписейНормПотреблений[0].НормаПотребленияУслуг;
                    СвязанныйНормаПотребленияУслуг = ?(ЗначениеЗаполнено(СвязанныйНормаПотребленияУслуг),
                            СвязанныйНормаПотребленияУслуг, Неопределено);
                    НаборЗаписейНормПотреблений.Очистить();
                КонецЕсли;
            КонецЕсли;
            НоваяЗапись = НаборЗаписейНормПотреблений.Добавить();

            // Заполнение данных
            ЗаполнитьЗначенияСвойств(НоваяЗапись, НормаПотребленияБП77, ,
                СтрШаблон("%1", КлючиЧисел));

            // Заполнение полей с преобразованием типов
            Для Каждого Ключ Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючиЧисел, ",", Ложь, Истина) Цикл
                НоваяЗапись[Ключ] = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НормаПотребленияБП77[Ключ]);
            КонецЦикла;

            НаборЗаписейНормПотреблений.Записать(Истина);
            РезультатФункции.КоличествоЗаписанных = РезультатФункции.КоличествоЗаписанных + 1;
        КонецЦикла;

        ЗафиксироватьТранзакцию(); // Записано успешно
    Исключение
        ОтменитьТранзакцию();

        ОбщаяЧастьСообщения = "Ошибка при загрузке данных норм потребления в регистр ""ГП_РасчетныеСчетаБП77"".";
        СтруктураОшибки = ГП_МиграцияОбщегоНазначения.ЗаписатьОшибкуВЖурнал(
                ОбщаяЧастьСообщения, ИнформацияОбОшибке(), Ложь, Истина);

        РезультатФункции.Успех = Ложь;
        РезультатФункции.СообщениеОбОшибке = СтрШаблон(
                "%1
                |Информация об ошибке: %2",
                ОбщаяЧастьСообщения,
                СтруктураОшибки.КраткоеПредставлениеОшибки);

        РезультатФункции.КоличествоЗаписанных = 0;
        РезультатФункции.КоличествоСохраненныхСвязей = 0;
    КонецПопытки;

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  НормаПотребленияБП77 - Структура
//      * Код - Строка - Код ГруппыПотребителей в БП77
//      * Группа - Строка - Наименование группы (папки) ГруппыПотребителей в БП77
//      * Наименование - Строка - Наименование ГруппыПотребителей в БП77
// Возвращаемое значение:
//  - РегистрСведений.ГП_НормыПотребленияБП77.НаборЗаписей
Функция СоздатьНаборЗаписейНормПотребленияБП77(Знач НормаПотребленияБП77) Экспорт
    НаборЗаписей = РегистрыСведений.ГП_НормыПотребленияБП77.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Код.Установить(НормаПотребленияБП77.Код);
    НаборЗаписей.Отбор.Группа.Установить(НормаПотребленияБП77.Группа);
    НаборЗаписей.Отбор.Наименование.Установить(НормаПотребленияБП77.Наименование);

    Возврат НаборЗаписей;
КонецФункции

// Возвращаемое значение:
//  - ТаблицаЗначений
//      * Код - Строка
//      * Наименование - Строка
//      * НормаХВ - Число
//      * ЕдИзмНормыХВКод - Строка
//      * ЕдИзмКоличестваХВКод - Строка
//      * ВидТарифаКод - Строка
Функция ПолучитьТаблицуДанныхДляСозданияНормПотребленияХВДляНаселения() Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ГП_НормыПотребленияБП77.Код КАК Код,
    |	ГП_НормыПотребленияБП77.Наименование КАК Наименование,
    |	ГП_НормыПотребленияБП77.НормаХВ КАК НормаХВ,
    |	ГП_НормыПотребленияБП77.ЕдИзмНормыХВКод КАК ЕдИзмНормыХВКод,
    |	ГП_НормыПотребленияБП77.ЕдИзмКоличестваХВКод КАК ЕдИзмКоличестваХВКод,
    |	ГП_НормыПотребленияБП77.ВидТарифаКод КАК ВидТарифаКод
    |ИЗ
    |	РегистрСведений.ГП_НормыПотребленияБП77 КАК ГП_НормыПотребленияБП77
    |ГДЕ
    |	ГП_НормыПотребленияБП77.ВидТарифаКод = ""1"" // Для населения
    |	И ГП_НормыПотребленияБП77.НормаХВ > 0
    |";

    РезультатЗапроса = Запрос.Выполнить();
    РезультатФункции = РезультатЗапроса.Выгрузить();
    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
// Гарант+ Килипенко 14.08.2024 [F00227047] перенос норм потребления из БП77 --
